МУИВРазработка_системы_тестирования_обучающихся_на_базе_платформы_1СПредприятиеv2/src/Documents/ТС_РезультатТестирования/ТС_РезультатТестирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ТС_РезультатТестирования</name>
  <registerRecords>InformationRegister.ТС_РезультатыТестирований</registerRecords>
  <attributes>
    <name>НомерТестирования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>CatalogRef.ТС_Курсы</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборТестов</name>
    <type>
      <types>CatalogRef.ТС_НаборыТестов</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.ТС_Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрограммаОбучения</name>
    <type>
      <types>CatalogRef.ТС_ПрограммыОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЭтапа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбменID</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Тесты</name>
    <attributes>
      <name>Тест</name>
      <type>
        <types>CatalogRef.ТС_Тесты</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Правильный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

МУИВРазработка_системы_тестирования_обучающихся_на_базе_платформы_1СПредприятиеv2/src/Catalogs/ТС_Тесты/ТС_Тесты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТС_Тесты</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.ТС_Курсы</owners>
  <attributes>
    <name>Вопрос</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Устаревший</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Изображение</name>
    <type>
      <types>CatalogRef.ТС_Файлы</types>
    </type>
  </attributes>
  <attributes>
    <name>Подсказка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПеремешиватьОтветы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбменID</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Ответы</name>
    <attributes>
      <name>Ответ</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Правильный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Подтверждение</name>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СсылкаПодтверждение</name>
      <type>
        <types>DocumentRef.ТС_РезультатТестирования</types>
        <types>CatalogRef.ТС_Файлы</types>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

МУИВРазработка_системы_тестирования_обучающихся_на_базе_платформы_1СПредприятиеv2/src/Documents/ТС_РезультатТестирования/ManagerModule.bsl
//*************************************************************
Функция ЗаполнитьПодтвержденияТестов(ТекДокумент) Экспорт
	
	ТекКомментарий = ТекДокумент.ТС_Комментарий;
	ОбработаноЭлементов = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТС_РезультатТестированияТесты.Тест
	|ПОМЕСТИТЬ ВТТестыИзДокумента
	|ИЗ
	|	Документ.ТС_РезультатТестирования.Тесты КАК ТС_РезультатТестированияТесты
	|ГДЕ
	|	ТС_РезультатТестированияТесты.Ссылка = &Ссылка
	|	И ТС_РезультатТестированияТесты.Правильный
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТестыИзДокумента.Тест
	|ИЗ
	|	ВТТестыИзДокумента КАК ТестыИзДокумента
	|ГДЕ
	|	НЕ ТестыИзДокумента.Тест В
	|			(ВЫБРАТЬ
	|				ТестыИзДокумента.Тест
	|			ИЗ
	|				ВТТестыИзДокумента КАК ТестыИзДокумента
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТС_Тесты.Подтверждение КАК ТС_ТестыПодтверждение
	|					ПО
	|						ТестыИзДокумента.Тест = ТС_ТестыПодтверждение.Ссылка
	|							И &Ссылка = ТС_ТестыПодтверждение.СсылкаПодтверждение)";
	
	Запрос.УстановитьПараметр("Ссылка", ТекДокумент);	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ТекТест = ВыборкаДетальныеЗаписи.Тест.ПолучитьОбъект();
		СтрокаПодтверждения = ТекТест.Подтверждение.Добавить();
		СтрокаПодтверждения.Описание = ТекКомментарий;
		СтрокаПодтверждения.СсылкаПодтверждение = ТекДокумент;
		Попытка
			 ТекТест.Записать();
			 ОбработаноЭлементов = ОбработаноЭлементов + 1;
		Исключение
			 Сообщить(ОписаниеОшибки());
		КонецПопытки;	 
		
	КонецЦикла;
	
	Возврат ОбработаноЭлементов;
	
КонецФункции

//**************************************************************
Функция ПостроитьСтрокуПравильныхОтветов(ТекТест)
	
	СтрокаОтвет = "";
	Для Каждого Строка ИЗ ТекТест.Ответы Цикл
		Если Строка.Правильный Тогда 
			СтрокаОтвет = ?(СтрДлина(СтрокаОтвет)=0,"",СтрокаОтвет + ", ") + Строка(Строка.НомерСтроки);
		КонецЕсли;
	КонецЦикла;
	Возврат СтрокаОтвет;
	
КонецФункции

//**************************************************************
Функция УстановитьСтатусИПодтверждения(ТекДокумент) Экспорт
	
	ТекОбъект = ТекДокумент.ПолучитьОбъект();
	
	Для Каждого Строка ИЗ ТекОбъект.Тесты Цикл
		СтрокаПравильных = ПостроитьСтрокуПравильныхОтветов(Строка.Тест);
		Если СтрокаПравильных = Строка.Ответ Тогда
			Строка.Правильный = Истина;
		Иначе
			Строка.Правильный = Ложь;
		КонецЕсли;
	КонецЦикла;	
	
	Попытка
		ТекОбъект.Записать();
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
	Если НЕ ЗаполнитьПодтвержденияТестов(ТекДокумент) ТОгда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;	
	
КонецФункции
